Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.ComputeRoomVolumeNotCheckedWarn Property
 The setting for calculation of Volume Computations is not on. The analysis model produced will be approximate without the computation of Areas and Volumes
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ComputeRoomVolumeNotCheckedWarn { get; }
Public Shared ReadOnly Property ComputeRoomVolumeNotCheckedWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ComputeRoomVolumeNotCheckedWarn {
	FailureDefinitionId^ get ();
}
static member ComputeRoomVolumeNotCheckedWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace